Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/bootloader/firmware/src/packs/WBZ351_DFP/component/pmu.h
/* -------- PMU_PMUCFG : (PMU Offset: 0x38) (R/W 32)  -------- */
#define PMU_PMUCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_PMUCFG)   Reset Value */

#define PMU_PMUCFG_BUCK_SW_DELAY_Pos          _UINT32_(0)                                          /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_SW_DELAY_Msk          (_UINT32_(0x7F) << PMU_PMUCFG_BUCK_SW_DELAY_Pos)     /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_SW_DELAY(value)       (PMU_PMUCFG_BUCK_SW_DELAY_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_SW_DELAY_Pos)) /* Assigment of value for BUCK_SW_DELAY in the PMU_PMUCFG register */
#define PMU_PMUCFG_MLDO_SW_DELAY_Pos          _UINT32_(8)                                          /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDO_SW_DELAY_Msk          (_UINT32_(0x3F) << PMU_PMUCFG_MLDO_SW_DELAY_Pos)     /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDO_SW_DELAY(value)       (PMU_PMUCFG_MLDO_SW_DELAY_Msk & (_UINT32_(value) << PMU_PMUCFG_MLDO_SW_DELAY_Pos)) /* Assigment of value for MLDO_SW_DELAY in the PMU_PMUCFG register */
#define PMU_PMUCFG_MLDOEXT_l_Pos              _UINT32_(14)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDOEXT_l_Msk              (_UINT32_(0x3) << PMU_PMUCFG_MLDOEXT_l_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDOEXT_l(value)           (PMU_PMUCFG_MLDOEXT_l_Msk & (_UINT32_(value) << PMU_PMUCFG_MLDOEXT_l_Pos)) /* Assigment of value for MLDOEXT_l in the PMU_PMUCFG register */
#define PMU_PMUCFG_BUCK_CP_L_Pos              _UINT32_(16)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_L_Msk              (_UINT32_(0xF) << PMU_PMUCFG_BUCK_CP_L_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_L(value)           (PMU_PMUCFG_BUCK_CP_L_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_CP_L_Pos)) /* Assigment of value for BUCK_CP_L in the PMU_PMUCFG register */
#define PMU_PMUCFG_BUCK_CP_H_Pos              _UINT32_(20)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_H_Msk              (_UINT32_(0xF) << PMU_PMUCFG_BUCK_CP_H_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_H(value)           (PMU_PMUCFG_BUCK_CP_H_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_CP_H_Pos)) /* Assigment of value for BUCK_CP_H in the PMU_PMUCFG register */
#define PMU_PMUCFG_ADC_CP_L_Pos               _UINT32_(24)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_L_Msk               (_UINT32_(0xF) << PMU_PMUCFG_ADC_CP_L_Pos)           /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_L(value)            (PMU_PMUCFG_ADC_CP_L_Msk & (_UINT32_(value) << PMU_PMUCFG_ADC_CP_L_Pos)) /* Assigment of value for ADC_CP_L in the PMU_PMUCFG register */
#define PMU_PMUCFG_ADC_CP_H_Pos               _UINT32_(28)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_H_Msk               (_UINT32_(0xF) << PMU_PMUCFG_ADC_CP_H_Pos)           /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_H(value)            (PMU_PMUCFG_ADC_CP_H_Msk & (_UINT32_(value) << PMU_PMUCFG_ADC_CP_H_Pos)) /* Assigment of value for ADC_CP_H in the PMU_PMUCFG register */
#define PMU_PMUCFG_Msk                        _UINT32_(0xFFFFFF7F)                                 /* (PMU_PMUCFG) Register Mask  */


/* -------- PMU_VBCCMD : (PMU Offset: 0x48) (R/W 32)  -------- */
#define PMU_VBCCMD_RESETVALUE                 _UINT32_(0x10000000)                                 /*  (PMU_VBCCMD)   Reset Value */

#define PMU_VBCCMD_VBCADDR_Pos                _UINT32_(0)                                          /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCADDR_Msk                (_UINT32_(0xFFFF) << PMU_VBCCMD_VBCADDR_Pos)         /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCADDR(value)             (PMU_VBCCMD_VBCADDR_Msk & (_UINT32_(value) << PMU_VBCCMD_VBCADDR_Pos)) /* Assigment of value for VBCADDR in the PMU_VBCCMD register */
#define PMU_VBCCMD_VBCRDY_Pos                 _UINT32_(28)                                         /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCRDY_Msk                 (_UINT32_(0x1) << PMU_VBCCMD_VBCRDY_Pos)             /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCRDY(value)              (PMU_VBCCMD_VBCRDY_Msk & (_UINT32_(value) << PMU_VBCCMD_VBCRDY_Pos)) /* Assigment of value for VBCRDY in the PMU_VBCCMD register */
#define PMU_VBCCMD_CMD_Pos                    _UINT32_(30)                                         /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_CMD_Msk                    (_UINT32_(0x1) << PMU_VBCCMD_CMD_Pos)                /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_CMD(value)                 (PMU_VBCCMD_CMD_Msk & (_UINT32_(value) << PMU_VBCCMD_CMD_Pos)) /* Assigment of value for CMD in the PMU_VBCCMD register */
#define PMU_VBCCMD_Msk                        _UINT32_(0x5000FFFF)                                 /* (PMU_VBCCMD) Register Mask  */


/* -------- PMU_VBCWDATA : (PMU Offset: 0x4C) (R/W 32)  -------- */
#define PMU_VBCWDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_VBCWDATA)   Reset Value */

#define PMU_VBCWDATA_VBCWDATA_Pos             _UINT32_(0)                                          /* (PMU_VBCWDATA)  Position */
#define PMU_VBCWDATA_VBCWDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_VBCWDATA_VBCWDATA_Pos)  /* (PMU_VBCWDATA)  Mask */
#define PMU_VBCWDATA_VBCWDATA(value)          (PMU_VBCWDATA_VBCWDATA_Msk & (_UINT32_(value) << PMU_VBCWDATA_VBCWDATA_Pos)) /* Assigment of value for VBCWDATA in the PMU_VBCWDATA register */
#define PMU_VBCWDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_VBCWDATA) Register Mask  */


/* -------- PMU_VBCRDATA : (PMU Offset: 0x50) (R/W 32)  -------- */
#define PMU_VBCRDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_VBCRDATA)   Reset Value */

