Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/bootloader/firmware/src/packs/WBZ351_DFP/component/pmu.h
#define PMU_WCMSIZ_SRAM1_SIZ_Pos              _UINT32_(8)                                          /* (PMU_WCMSIZ)  Position */
#define PMU_WCMSIZ_SRAM1_SIZ_Msk              (_UINT32_(0x3) << PMU_WCMSIZ_SRAM1_SIZ_Pos)          /* (PMU_WCMSIZ)  Mask */
#define PMU_WCMSIZ_SRAM1_SIZ(value)           (PMU_WCMSIZ_SRAM1_SIZ_Msk & (_UINT32_(value) << PMU_WCMSIZ_SRAM1_SIZ_Pos)) /* Assigment of value for SRAM1_SIZ in the PMU_WCMSIZ register */
#define   PMU_WCMSIZ_SRAM1_SIZ_NO_SRAM_RETENTION_Val _UINT32_(0x0)                                        /* (PMU_WCMSIZ) FlexRAM is completely powered OFF  */
#define   PMU_WCMSIZ_SRAM1_SIZ_16K_SRAM_Val   _UINT32_(0x1)                                        /* (PMU_WCMSIZ) 16K Flex RAM available in retention  */
#define   PMU_WCMSIZ_SRAM1_SIZ_32K_SRAM_Val   _UINT32_(0x2)                                        /* (PMU_WCMSIZ) 32K Flex RAM available in retention  */
#define   PMU_WCMSIZ_SRAM1_SIZ_RESERVED_Val   _UINT32_(0x3)                                        /* (PMU_WCMSIZ) Reserved  */
#define PMU_WCMSIZ_SRAM1_SIZ_NO_SRAM_RETENTION (PMU_WCMSIZ_SRAM1_SIZ_NO_SRAM_RETENTION_Val << PMU_WCMSIZ_SRAM1_SIZ_Pos) /* (PMU_WCMSIZ) FlexRAM is completely powered OFF Position  */
#define PMU_WCMSIZ_SRAM1_SIZ_16K_SRAM         (PMU_WCMSIZ_SRAM1_SIZ_16K_SRAM_Val << PMU_WCMSIZ_SRAM1_SIZ_Pos) /* (PMU_WCMSIZ) 16K Flex RAM available in retention Position  */
#define PMU_WCMSIZ_SRAM1_SIZ_32K_SRAM         (PMU_WCMSIZ_SRAM1_SIZ_32K_SRAM_Val << PMU_WCMSIZ_SRAM1_SIZ_Pos) /* (PMU_WCMSIZ) 32K Flex RAM available in retention Position  */
#define PMU_WCMSIZ_SRAM1_SIZ_RESERVED         (PMU_WCMSIZ_SRAM1_SIZ_RESERVED_Val << PMU_WCMSIZ_SRAM1_SIZ_Pos) /* (PMU_WCMSIZ) Reserved Position  */
#define PMU_WCMSIZ_Msk                        _UINT32_(0x00000300)                                 /* (PMU_WCMSIZ) Register Mask  */


/** \brief PMU register offsets definitions */
#define PMU_SPICTRL_REG_OFST           _UINT32_(0x00)      /* (PMU_SPICTRL)  Offset */
#define PMU_SPISTATUS_REG_OFST         _UINT32_(0x04)      /* (PMU_SPISTATUS)  Offset */
#define PMU_CLKCTRL_REG_OFST           _UINT32_(0x08)      /* (PMU_CLKCTRL)  Offset */
#define PMU_MODECTRL1_REG_OFST         _UINT32_(0x0C)      /* (PMU_MODECTRL1)  Offset */
#define PMU_MODECTRL2_REG_OFST         _UINT32_(0x10)      /* (PMU_MODECTRL2)  Offset */
#define PMU_MODECTRL3_REG_OFST         _UINT32_(0x14)      /* (PMU_MODECTRL3)  Offset */
#define PMU_MODECTRL4_REG_OFST         _UINT32_(0x18)      /* (PMU_MODECTRL4)  Offset */
#define PMU_OVERCTRL_REG_OFST          _UINT32_(0x1C)      /* (PMU_OVERCTRL)  Offset */
#define PMU_PMUCMODE_REG_OFST          _UINT32_(0x20)      /* (PMU_PMUCMODE)  Offset */
#define PMU_PMUSTATUS_REG_OFST         _UINT32_(0x24)      /* (PMU_PMUSTATUS)  Offset */
#define PMU_PMUSEQ1_REG_OFST           _UINT32_(0x28)      /* (PMU_PMUSEQ1)  Offset */
#define PMU_PMUSEQ2_REG_OFST           _UINT32_(0x2C)      /* (PMU_PMUSEQ2)  Offset */
#define PMU_PMUSEQ3_REG_OFST           _UINT32_(0x30)      /* (PMU_PMUSEQ3)  Offset */
#define PMU_PMUSEQ4_REG_OFST           _UINT32_(0x34)      /* (PMU_PMUSEQ4)  Offset */
#define PMU_PMUCFG_REG_OFST            _UINT32_(0x38)      /* (PMU_PMUCFG)  Offset */
#define PMU_VBCCMD_REG_OFST            _UINT32_(0x48)      /* (PMU_VBCCMD)  Offset */
#define PMU_VBCWDATA_REG_OFST          _UINT32_(0x4C)      /* (PMU_VBCWDATA)  Offset */
#define PMU_VBCRDATA_REG_OFST          _UINT32_(0x50)      /* (PMU_VBCRDATA)  Offset */
#define PMU_WCMCFG_REG_OFST            _UINT32_(0x54)      /* (PMU_WCMCFG)  Offset */
#define PMU_PMUIENB_REG_OFST           _UINT32_(0x58)      /* (PMU_PMUIENB)  Offset */
#define PMU_PMUISTAT_REG_OFST          _UINT32_(0x5C)      /* (PMU_PMUISTAT)  Offset */
#define PMU_WCMSIZ_REG_OFST            _UINT32_(0x60)      /* (PMU_WCMSIZ)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PMU register API structure */
typedef struct
{  /* PMU SPI controller */
  __IO  uint32_t                       PMU_SPICTRL;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       PMU_SPISTATUS;      /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       PMU_CLKCTRL;        /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL1;      /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL2;      /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL3;      /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL4;      /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       PMU_OVERCTRL;       /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       PMU_PMUCMODE;       /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSTATUS;      /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ1;        /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ2;        /**< Offset: 0x2C (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ3;        /**< Offset: 0x30 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ4;        /**< Offset: 0x34 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUCFG;         /**< Offset: 0x38 (R/W  32)  */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       PMU_VBCCMD;         /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       PMU_VBCWDATA;       /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       PMU_VBCRDATA;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       PMU_WCMCFG;         /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUIENB;        /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUISTAT;       /**< Offset: 0x5C (R/W  32)  */
  __IO  uint32_t                       PMU_WCMSIZ;         /**< Offset: 0x60 (R/W  32)  */
} pmu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ35_PMU_COMPONENT_H_ */
